In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({'name':['홍길동','성길동','홍순신','박길동','김길동'], 'age':[100,200,300,400,500]})

In [3]:
plma=lambda a: "양수" if a > 0 else "음수"
ages=lambda b: "고령" if b>=200 else'보통'

In [4]:
df['n/p']=list(map(plma,df['age']))
df['ages_result']=list(map(ages,df['age']))

In [5]:
df

  name  age n/p ages_result
0  홍길동  100  양수          보통
1  성길동  200  양수          고령
2  홍순신  300  양수          고령
3  박길동  400  양수          고령
4  김길동  500  양수          고령

In [6]:
##람다함수
##name에 홍이라는 글자를 포함하고있으면 1 아니면 0

names=lambda a: "1" if '홍'in a else "0"

In [7]:
df['name_result']=list(map(names,df['name']))

In [8]:
list(filter(names,df['name']))

['홍길동', '성길동', '홍순신', '박길동', '김길동']

In [9]:
df

  name  age n/p ages_result name_result
0  홍길동  100  양수          보통           1
1  성길동  200  양수          고령           0
2  홍순신  300  양수          고령           1
3  박길동  400  양수          고령           0
4  김길동  500  양수          고령           0

In [10]:
plma=lambda a: 1 if a.equals("양수")  else 0
df['n/p_result']=list(map(names,df['n/p']))
df

  name  age n/p ages_result name_result n/p_result
0  홍길동  100  양수          보통           1          0
1  성길동  200  양수          고령           0          0
2  홍순신  300  양수          고령           1          0
3  박길동  400  양수          고령           0          0
4  김길동  500  양수          고령           0          0

In [13]:
agg=lambda a: 1 if a =="고령"  else 0
df['ages_result2']=list(map(agg,df['ages_result']))
df

  name  age n/p ages_result name_result n/p_result  ages_result2
0  홍길동  100  양수          보통           1          0             0
1  성길동  200  양수          고령           0          0             1
2  홍순신  300  양수          고령           1          0             1
3  박길동  400  양수          고령           0          0             1
4  김길동  500  양수          고령           0          0             1

In [21]:
def func_agg2(a):
    if 100<=a<=200:
        return 0
    elif 200<=450:
        return 1
    else:
        return 2

In [ ]:
df['ages_result2']=list(map(func_agg2,df['age']))
df

In [22]:
agg2=lambda a: 0 if 100<=a<=200 else(1 if 200<a<450 else 2)
df['ages_result3']=list(map(agg2,df['age']))
df

  name  age n/p ages_result name_result n/p_result  ages_result2  ages_result3
0  홍길동  100  양수          보통           1          0             0             0
1  성길동  200  양수          고령           0          0             0             0
2  홍순신  300  양수          고령           1          0             1             1
3  박길동  400  양수          고령           0          0             1             1
4  김길동  500  양수          고령           0          0             2             2

In [ ]:
gg=lambda name:  print(name, '이 참석하지 않았습니다.') if name not in human else print(name, ' 참석하였습니다.')
gg(input("확인하고싶은 이름 입력:"))

In [50]:
human=['김길동', '성길동', '박길동']
name=input("확인하고싶은 이름 입력:")
if name not in human :
    print(name, '이 참석하지 않았습니다.')
    
else:
    print(name, ' 참석하였습니다.')

확인하고싶은 이름 입력:
 이 참석하지 않았습니다.

In [35]:
gg=lambda name:  print(name, '이 참석하지 않았습니다.') if name not in human else print(name, ' 참석하였습니다.')
gg(input("확인하고싶은 이름 입력:"))

확인하고싶은 이름 입력:홍길동
확인하고싶은 이름 입력:홍길동
홍길동 이 참석하지 않았습니다.

In [34]:
def func (name): 
    if name not in human :
        print(name, '이 참석하지 않았습니다.')
    
    else:
        print(name, ' 참석하였습니다.')

In [37]:
func(input("확인하고싶은 이름 입력:"))

확인하고싶은 이름 입력:홍길동
홍길동 이 참석하지 않았습니다.

In [23]:
##apply함수 적용시키다. 
#컬럼명.apply

In [25]:
df.columns

Index(['name', 'age', 'n/p', 'ages_result', 'name_result', 'n/p_result',
       'ages_result2', 'ages_result3'],
      dtype='object')

In [28]:
df['ageplus1']=df['age'].apply(lambda x:x+1)

In [29]:
df

,name,age,n/p,ages_result,name_result,n/p_result,ages_result2,ages_result3,ageplus1
0,홍길동,100,양수,보통,1,0,0,0,101
1,성길동,200,양수,고령,0,0,0,0,201
2,홍순신,300,양수,고령,1,0,1,1,301
3,박길동,400,양수,고령,0,0,1,1,401
4,김길동,500,양수,고령,0,0,2,2,501

In [30]:
#d일반함수를 만들어 apply 적용

In [35]:
df['name'][0][0]

'홍'

In [41]:
def name_func(name):
    if name[0]== "송":
        return "송"
    else:
        return name[0]

In [44]:
nm=lambda name : "송" if name[0]== "송"  else name[0]

In [42]:
df['name_apply']=df['name'].apply(name_func)

In [40]:
df

,name,age,n/p,ages_result,name_result,n/p_result,ages_result2,ages_result3,ageplus1,name_apply
0,홍길동,100,양수,보통,1,0,0,0,101,홍
1,성길동,200,양수,고령,0,0,0,0,201,성
2,홍순신,300,양수,고령,1,0,1,1,301,홍
3,박길동,400,양수,고령,0,0,1,1,401,박
4,김길동,500,양수,고령,0,0,2,2,501,김

In [47]:
df['name_apply2']=df['name'].apply(nm)

In [48]:
df

,name,age,n/p,ages_result,name_result,n/p_result,ages_result2,ages_result3,ageplus1,name_apply,name_apply2
0,홍길동,100,양수,보통,1,0,0,0,101,홍,홍
1,성길동,200,양수,고령,0,0,0,0,201,성,성
2,홍순신,300,양수,고령,1,0,1,1,301,홍,홍
3,박길동,400,양수,고령,0,0,1,1,401,박,박
4,김길동,500,양수,고령,0,0,2,2,501,김,김

In [49]:
raw_data = pd.read_excel('./titanic.xls')
raw_data

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN